# Day 25 - Pandas

In [1]:
import pandas as pd
import numpy as np

### 1. The following DataFrames are given. Using the pd.merge() function make an INNNER join of employees and departments DataFrames based on the dept_id column.

In response, print the result to the console.

In [2]:
employees = pd.DataFrame({
    'emp_id': ['1001', '1002', '1003', '1004'],
    'first_name': ['John', 'Mark', 'Bob', 'Alice'],
    'last_name': ['Smith', 'Cook', 'Cat', 'Lee'],
    'dept_id': ['002', '001', '001', '005']
})

departments = pd.DataFrame({
    'dept_id': ['001', '002', '003', '004'],
    'dept_name': ['IT', 'Sales', 'Marketing', 'Support']
})

# Start your code here
result = pd.merge(employees, departments, how='inner', on='dept_id')
print(result)

  emp_id first_name last_name dept_id dept_name
0   1001       John     Smith     002     Sales
1   1002       Mark      Cook     001        IT
2   1003        Bob       Cat     001        IT

---

### 2. The following DataFrames are given. Using the pd.merge() function make a LEFT join of employees and departments DataFrames based on the dept_id column. Note that the departments DataFrame doesn't have a department with dept_id == '005'.

In response, print result to the console.

In [3]:
result = pd.merge(employees, departments, how='left', on='dept_id')
print(result)

  emp_id first_name last_name dept_id dept_name
0   1001       John     Smith     002     Sales
1   1002       Mark      Cook     001        IT
2   1003        Bob       Cat     001        IT
3   1004      Alice       Lee     005       NaN

---

### 3. The following DataFrames are given. Using the pd.merge() function make a RIGHT join of employees and departments DataFrames based on the dept_id column. Note that the employees object doesn't have employees for departments with dept_id of '003' and '004'.

In response, print result to the console.

In [4]:
result = pd.merge(employees, departments, how='right', on='dept_id')
result

  emp_id first_name last_name dept_id  dept_name
0   1002       Mark      Cook     001         IT
1   1003        Bob       Cat     001         IT
2   1001       John     Smith     002      Sales
3    NaN        NaN       NaN     003  Marketing
4    NaN        NaN       NaN     004    Support

---

### 4. The following DataFrames are given. Using the pd.merge() function make an OUTER join of employees and departments DateFrames based on the dept_id column. Note that the employees DataFrmae doesn't have employees for departments with dept_id of '003' and '004'. Also note that the departments DataFrame doesn't have a department with dept_id '005'.

In response, print result to the console.

In [5]:
result = pd.merge(employees, departments, how='outer', on='dept_id')
result

  emp_id first_name last_name dept_id  dept_name
0   1001       John     Smith     002      Sales
1   1002       Mark      Cook     001         IT
2   1003        Bob       Cat     001         IT
3   1004      Alice       Lee     005        NaN
4    NaN        NaN       NaN     003  Marketing
5    NaN        NaN       NaN     004    Support

---

### 5. The following DataFrames are given. Notice that we have a duplicate row in the employees DataFrame this time. Using the pd.merge() function make an INNER join of employees and departments DataFrames based on the dept_id column.

In response, print result to the consol

Comment: Notice that the duplicate row is also included in the result. We will solve this problem in the next exercise.e.

In [7]:
employees = pd.DataFrame({
    'emp_id': ['1001', '1002', '1003', '1003', '1004'],
    'first_name': ['John', 'Mark', 'Bob', 'Bob', 'Alice'],
    'last_name': ['Smith', 'Cook', 'Cat', 'Cat', 'Lee'],
    'dept_id': ['002', '001', '001', '001', '005']
})

departments = pd.DataFrame({
    'dept_id': ['001', '002', '003', '004'],
    'dept_name': ['IT', 'Sales', 'Marketing', 'Support']
})

# Start your code here
result = pd.merge(employees, departments, how='inner', on='dept_id')
print(result)

  emp_id first_name last_name dept_id dept_name
0   1001       John     Smith     002     Sales
1   1002       Mark      Cook     001        IT
2   1003        Bob       Cat     001        IT
3   1003        Bob       Cat     001        IT

## Congratulate, Day 25 Finished!